Z_h_PV/testcases/laminarFlamelet/B-ResultsOrig/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(rho|p)"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1.0e-08;
        relTol          1.0e-03;
    }

   "(rho|p)Final"
    {
        $rho;
        tolerance       1.0e-09;
        relTol          0.0;
    }

    "(U|PV|PVvar|h|Z)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1.0e-08;
        relTol          1.0e-03;
    }

    "(U|PV|PVvar|h|Z)Final"
    {
        $U;
        tolerance       1.0e-09;
        relTol          0.0;
    }
}

PIMPLE
{
    transonic           no;
    nCorrectors         1;
    nOuterCorrectors    3;
    nNonOrthogonalCorrectors 0;
    momentumPredictor   yes;
}

relaxationFactors
{
    fields
    {
        ".*"            1;
    }
    equations
    {
        ".*"            1;
    }
}

// ************************************************************************* //
