Z_h_PV/testcases/laminarFlamelet/B-ResultsOrig/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
//    volScalarFieldValue T    INITIALTEMPERATURE
    volScalarFieldValue PV   -7.1736792216e-03
);

regions
(
    boxToCell
    {
        box (1.5e-2 -1.0 -1.0) (5.0e-2 1.0 1.0) ;
        fieldValues
        (
//            volScalarFieldValue T   FINALTEMPERATURE
            volScalarFieldValue PV  7.1669021364e-03
        );
    }
);

// ************************************************************************* //
